# EnterPressed Event

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextBox..::..EnterPressed Event
TextBox Class See Also
---
Subscribe to this event to be notified when the Enter button is pressed in the text box.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public event EventHandler<TextBoxEnterPressedEventArgs> EnterPressed
```

Visual Basic
---
```text
Public Event EnterPressed As EventHandler(Of TextBoxEnterPressedEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<TextBoxEnterPressedEventArgs^>^ EnterPressed {
	void add (EventHandler<TextBoxEnterPressedEventArgs^>^ value);
	void remove (EventHandler<TextBoxEnterPressedEventArgs^>^ value);
}
```

# See Also
TextBox Class
Autodesk.Revit.UI Namespace